<?php
//可以放栏目中的相关类型数组
//类型
$arrMType = array();
$arrMType['year']			= range(1950,date('Y'));
$arrMType['month']			= range(1,12);
$arrMType['day']			= range(1,31);
$arrMType['sex']			= array(0=>'不限',1=>'男',2=>'女');
$arrMType['intro']	= array('我的性格比较开朗，随和，关心周围的任何事，并且对生活充满了信心，我是一个热爱生活的U客。','在外地求学的几年生活，我养成了坚强的性格,这种性格使我克服了学习和生活中的一些困难，希望大家能够认可我，多给我机会，我的U客口号是：世上无难事，只要肯攀登！','我是一个活泼开朗的人，我爱好看书，很喜欢打篮球，也很喜欢学习，更喜欢旅游，愿结交真诚的U客。','总体来说我是个安静的人，但如果在朋友面前说我内向，会遭致异口同声的鄙视与反对。我向往的生活是像U客般的自由自在。','我是一个热爱生活、享受生活、追求、创造美好生活的人，天生一副热心肠，独乐乐不如众乐乐，喜欢分享美好的事物，拥有一颗好奇的心。','人生最重要的不是所在的位置，而是所朝的方向，愿结交志同道合的驴友。','我喜欢回味生活，周游世界，也许那并不是快乐的回忆，但它能让我懂的更多。','我喜欢旅游，网球，F1，音乐。我在业余时间最大的消遣是听歌，泡U客网。','我性格开朗，温柔大方，善解人意，没有什么脾气，因为理解的多，所以也就没有脾气了，你愿意和我一起感受世界，体验U客生活吗？','我看漫画，看心理学，看各种小说以及散文。喜欢在不同的心境的时候看不同的文字。喜欢文字里那种跳跃的思维方式，加入U客只是为了满足自己的猎奇心理！','我喜欢旅游。我在业余时间最大的消遣是看电影上U客网。我憧憬的生活是自由自在。','本人为人善良，为人正直，是一个平常的不能再平常的U客。','我很平凡，但是我绝不缺乏生活的热情和生命的梦想。U客网是能够让我实现梦想的地方！','我热爱U客生活，做U客，即能旅游，又能交友，真是太好了。','我通过做U客，赚取了我人生的第一桶金。','今天你U了吗？','热爱旅游，热爱交友，热爱U客','我爱互助游，我爱U客生活！','U客网让我赚到了人生第一桶金，我会再接再励做个好U客！','互助游真的好时尚，U客互助是我体验最好的旅游方式','全球U客是一家，旅游互助靠大家！','U客生活改变了我的人生，我热爱做U客！','我是专业的U客，找我服务，体验不一样的旅游！','U客真的又玩又能挣钱吗？');
?>